run/conjugateBatteryCC/system/blockMeshDict_cp
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | foam-extend: Open Source CFD                    |
|  \\    /   O peration     | Version:     5.0                                |
|   \\  /    A nd           | Web:         http://www.foam-extend.org         |
|    \\/     M anipulation  | For copyright notice see file Copyright         |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      blockMeshDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

scale   0.001;

vertices
(
    // Plane 1
    ( -58.5 -98   0 )
    ( -58.5 -80   0 )
    ( -58.5  80   0 )
    ( -58.5  98   0 )
    ( -40   -98   0 )
    ( -40   -80   0 )
    ( -40    80   0 )
    ( -40    98   0 )
    (  40   -98   0 )
    (  40   -80   0 )
    (  40    80   0 )
    (  40    98   0 )
    (  58.5 -98   0 )
    (  58.5 -80   0 )
    (  58.5  80   0 )
    (  58.5  98   0 )
    // Plane 2
    ( -58.5 -98   34 )
    ( -58.5 -80   34 )
    ( -58.5  80   34 )
    ( -58.5  98   34 )
    ( -40   -98   34 )
    ( -40   -80   34 )
    ( -40    80   34 )
    ( -40    98   34 )
    (  40   -98   34 )
    (  40   -80   34 )
    (  40    80   34 )
    (  40    98   34 )
    (  58.5 -98   34 )
    (  58.5 -80   34 )
    (  58.5  80   34 )
    (  58.5  98   34 )
    // Plane 3
    ( -58.5 -98   50 )
    ( -58.5 -80   50 )
    ( -58.5  80   50 )
    ( -58.5  98   50 )
    ( -40   -98   50 )
    ( -40   -80   50 )
    ( -40    80   50 )
    ( -40    98   50 )
    (  40   -98   50 )
    (  40   -80   50 )
    (  40    80   50 )
    (  40    98   50 )
    (  58.5 -98   50 )
    (  58.5 -80   50 )
    (  58.5  80   50 )
    (  58.5  98   50 )
);

blocks
(
    // Bottom blocks
    hex (0 4 5 1 16 20 21 17) ( 10 10 20 ) simpleGrading (5 5 0.2)
    hex (1 5 6 2 17 21 22 18) ( 10 40 20 ) simpleGrading (5 1 0.2)
    hex (2 6 7 3 18 22 23 19) ( 10 10 20 ) simpleGrading (5 0.2 0.2)
    hex (4 8 9 5 20 24 25 21) ( 20 10 20 ) simpleGrading (1 5 0.2)
    hex (5 9 10 6 21 25 26 22) ( 20 40 20 ) simpleGrading (1 1 0.2)
    hex (6 10 11 7 22 26 27 23) ( 20 10 20 ) simpleGrading (1 0.2 0.2)
    hex (8 12 13 9 24 28 29 25) ( 10 10 20 ) simpleGrading (0.2 5 0.2)
    hex (9 13 14 10 25 29 30 26) ( 10 40 20 ) simpleGrading (0.2 1 0.2)
    hex (10 14 15 11 26 30 31 27) ( 10 10 20 ) simpleGrading (0.2 0.2 0.2)
    // Top blocks
    hex (16 20 21 17 32 36 37 33) ( 10 10 10 ) simpleGrading (5 5 5)
    hex (17 21 22 18 33 37 38 34) ( 10 40 10 ) simpleGrading (5 1 5)
    hex (18 22 23 19 34 38 39 35) ( 10 10 10 ) simpleGrading (5 0.2 5)
    hex (20 24 25 21 36 40 41 37) ( 20 10 10 ) simpleGrading (1 5 5)
    // Solid lithium block missing
    hex (22 26 27 23 38 42 43 39) ( 20 10 10 ) simpleGrading (1 0.2 5)
    hex (24 28 29 25 40 44 45 41) ( 10 10 10 ) simpleGrading (0.2 5 5)
    hex (25 29 30 26 41 45 46 42) ( 10 40 10 ) simpleGrading (0.2 1 5)
    hex (26 30 31 27 42 46 47 43) ( 10 10 10 ) simpleGrading (0.2 0.2 5)
);

edges
(
);

boundary
(
    liquidToSteelInterface
    {
        type            regionCouple;
        shadowRegion    solid;
        shadowPatch     steelInterface;
        zone            liquidToSteelInterfaceZone;
        attached        off;
        master          on;
        isWall          on;
        bridgeOverlap   off;

        faces
        (
            // Bottom layer
            (0 16 17 1)
            (1 17 18 2)
            (2 18 19 3)
            (3 19 23 7)
            (7 23 27 11)
            (11 27 31 15)
            (15 31 30 14)
            (14 30 29 13)
            (13 29 28 12)
            (12 28 24 8)
            (8 24 20 4)
            (4 20 16 0)
            // Top layer
            (16 32 33 17)
            (17 33 34 18)
            (18 34 35 19)
            (19 35 39 23)
            (23 39 43 27)
            (27 43 47 31)
            (31 47 46 30)
            (30 46 45 29)
            (29 45 44 28)
            (28 44 40 24)
            (24 40 36 20)
            (20 36 32 16)
            // bottom wall
            (0 1 5 4)
            (1 2 6 5)
            (2 3 7 6)
            (4 5 9 8)
            (5 6 10 9)
            (6 7 11 10)
            (8 9 13 12)
            (9 10 14 13)
            (10 11 15 14)
        );
    }
    liquidToLithiumInterface
    {
        type            regionCouple;
        shadowRegion    solid;
        shadowPatch     lithiumInterface;
        zone            liquidToLithiumInterfaceZone;
        attached        off;
        master          on;
        isWall          on;
        bridgeOverlap   off;
        faces
        (
            // Sides
            (21 22 38 37)
            (22 26 42 38)
            (26 25 41 42)
            (25 21 37 41)
            // Bottom
            (21 25 26 22)
        );
    }
    topSurface
    {
        type patch;
        faces
        (
            (32 36 37 33)
            (33 37 38 34)
            (34 38 39 35)
            (36 40 41 37)
            (38 42 43 39)
            (40 44 45 41)
            (41 45 46 42)
            (42 46 47 43)
        );
    }
);


mergePatchPairs
(
);

// ************************************************************************* //
