run/conjugateBatteryCC/0/pd
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | foam-extend: Open Source CFD                    |
|  \\    /   O peration     | Version:     5.0                                |
|   \\  /    A nd           | Web:         http://www.foam-extend.org         |
|    \\/     M anipulation  | For copyright notice see file Copyright         |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volScalarField;
    object      pd;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [1 -1 -2 0 0 0 0];

internalField   uniform 0;

boundaryField
{
    liquidToSteelInterface
    {
        type            zeroGradient;
    }
    liquidToLithiumInterface
    {
        type            zeroGradient;
    }
    topSurface
    {
        type            totalPressure;
        p0              uniform 0;
        gamma           1;
        value           uniform 0;
    }
}

// ************************************************************************* //
